packages/j2o/j2o-0.0.4.tar.gz/j2o-0.0.4/README.org
* j2o
Converter from Jupyter to Org file format without any dependencies.

I don't want to install Jupyter core and nbconver or pandoc with 164
 dependencies just to be able to convert simple JSON format, that is
 why I just wrote coverter from scratch.

Tested for nbformat: 4.2.

TODO: make reverse convrter.

https://pypi.org/project/j2o/

* Command line usage
#+begin_src text
usage: j2o myfile.ipynb [-w] [-j myfile.ipynb] [-o myfile.org]

Convert a Jupyter notebook to Org file (Emacs) and vice versa

positional arguments:
  jupfile_              Jupyter file

options:
  -h, --help            show this help message and exit
  -j JUPFILE, --jupfile JUPFILE
                        Jupyter file
  -o ORGFILE, --orgfile ORGFILE
                        Target filename of Org file. If not specified, it will
                        use the filename of the Jupyter file and append .ipynb
  -w, --overwrite       Flag whether to overwrite existing target file.
#+end_src
* Other useful projects
- p2j https://pypi.org/project/p2j/ https://github.com/remykarem/python2jupyter
- https://github.com/jkitchin/ox-ipynb
* Review of format for ipynb
JSON
#+begin_src json
{
  cells: [
    cell_type: "code/markdown",
    source: ["\n","\n",""],
    outputs: [{
      text: ["\n", "\n"],
      data: {
        image/png: "base64....",
        text/plain: "image description"}
      }
    ]
  ],
  metadata: {
    kernelspec: {
      language: "python"
    }
  }
}
#+end_src

* How it works
1) Loops through "cells".
2) Extract "source"
3) add Org header and tail around source ("#+begin_src python ...", "#+end_src")
* features
- in markdown cells conversion: source blocks, ‘#’ to ‘*’.
- code cells: images
